# 2. Создайте собственный класс-исключение, обрабатывающий ситуацию деления на нуль.
#    Проверьте его работу на данных, вводимых пользователем.
#    При вводе пользователем нуля в качестве делителя программа должна корректно обработать
#    эту ситуацию и не завершиться с ошибкой.

class OwnError ():
    def __init__ (self, txt):
        self.txt = txt

    @classmethod
    def Div(self, div_1, div_2):
        try:
            div_1 = int(div_1)
            div_2 = int(div_2)
            if div_2 == 0:
                return print('Вы ввели НОЛЬ в качестве делителя. На ноль делить НЕЛЬЗЯ !')
        except ValueError:
            print('Вы ввели не число')
        else:
            print(f'Результат: {div_1 / div_2}')


div_1 = input('Введите делимое: ')
div_2 = input('Введите делитель: ')
OwnError.Div(div_1, div_2)

