# 6. Реализовать два небольших скрипта:
#    а) итератор, генерирующий целые числа, начиная с указанного,
#    б) итератор, повторяющий элементы некоторого списка, определенного заранее.
#    Подсказка: использовать функцию count() и cycle() модуля itertools.
#    Обратите внимание, что создаваемый цикл не должен быть бесконечным.
#    Необходимо предусмотреть условие его завершения.

#    Например, в первом задании выводим целые числа, начиная с 3, а при достижении числа 10 завершаем цикл.
#    Во втором также необходимо предусмотреть условие, при котором повторение элементов списка будет прекращено.

from itertools import count
from itertools import cycle

print('\n1. Итератор, генерирующий целые числа, начиная с указанного')
digit_start = int(input('Введите стартовое число: '))
digit_end = int(input('Введите конечное число: '))

for el in count(digit_start):
    if el > digit_end:
        break
    else:
        print(el)


print('\n2. Итератор, повторяющий элементы некоторого списка')
my_str = input('Введите элементы списка через пробел: ')
my_count = int(input('Введите количество повторов: '))
n = 0
my_list = my_str.split()
for el in cycle(my_list):
    if n > my_count:
        break
    print(el)
    n += 1