# 2. Реализовать класс Road (дорога), в котором определить атрибуты: length (длина), width (ширина).
#    Значения данных атрибутов должны передаваться при создании экземпляра класса. Атрибуты сделать защищенными.
#    Определить метод расчета массы асфальта, необходимого для покрытия всего дорожного полотна.
#    Использовать формулу: длина * ширина * масса асфальта для покрытия одного кв метра дороги асфальтом,
#    толщиной в 1 см * чи сло см толщины полотна. Проверить работу метода.
#
#    Например: 20м * 5000м * 25кг * 5см = 12500 т

class Road():

    def mass(self, _length, _width):
        m = _length * _width * thickness * mass_1cm /1000
        print('Необходимо {:.2f} тонн асфальта'.format(m))


_length = float(input('Введите длину дороги, м: '))
_width = float(input('Введите ширину дороги, м: '))
thickness = float(input('Введите толщину полотна, cм: '))
mass_1cm = float(input('Введите массу асфальта для покрытия 1 кв. м дороги асфальтом, толщиной в 1 см, кг: '))

new_road = Road()
new_road.mass(_length, _width)
